<a href="https://colab.research.google.com/github/mikeamerenda/mikeamerenda/blob/main/Pandas_Exercises_on_the_Titanic_Dataset_(Core).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

1) Display the head of the dataframe.

In [ ]:
df = pd.read_csv('/content/titanic.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

2) What is the percentage of people who survived? (hint: find the mean of the survival column).

In [ ]:
df['Survived'].mean()

0.3838383838383838

3) How many of each sex survived?

In [ ]:
male_filter =df[df['Sex']=='male']
male_filter.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S

[5 rows x 12 columns]

In [71]:
male_survived = male_filter['Survived'].mean()
male_survived

0.18890814558058924

In [ ]:
female_filter =df[df['Sex']=='female']
female_filter.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[5 rows x 12 columns]

In [69]:
female_survived = female_filter['Survived'].mean()
female_survived

0.7420382165605095

About 19% of the males and 74% of the femals survived

4) Considering only the group of passengers who paid less than $10, what percentage of this group survived?

In [39]:
fare_filter = df[df['Fare'] <=10]
fare_filter

     PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
0              1         0       3  ...  7.2500   NaN         S
2              3         1       3  ...  7.9250   NaN         S
4              5         0       3  ...  8.0500   NaN         S
5              6         0       3  ...  8.4583   NaN         Q
12            13         0       3  ...  8.0500   NaN         S
..           ...       ...     ...  ...     ...   ...       ...
877          878         0       3  ...  7.8958   NaN         S
878          879         0       3  ...  7.8958   NaN         S
881          882         0       3  ...  7.8958   NaN         S
884          885         0       3  ...  7.0500   NaN         S
890          891         0       3  ...  7.7500   NaN         Q

[336 rows x 12 columns]

In [40]:
fare_filter['Survived'].mean()

0.19940476190476192

About 20% of passengers who paid less than $10 survived

5) Overall, what is the average age of those who didn't survive?

In [41]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [45]:
nonsurvivor_filter = df[df['Survived']==0]
nonsurvivor_filter.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S

[5 rows x 12 columns]

In [73]:
average_age_of_nonsurvivor = nonsurvivor_filter['Age'].mean()
average_age_of_nonsurvivor

30.62617924528302

6) Overall, what is the average age of those who did survive?

In [47]:
survivor_filter = df[df['Survived']==1]
survivor_filter.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[5 rows x 12 columns]

In [67]:
average_age_of_survivor =survivor_filter['Age'].mean()
average_age_of_survivor

28.343689655172415

7) What is the average age of those who did and didn't survive grouped by Sex?

In [76]:
df.groupby(['Survived','Sex'])[['Age']].mean()

                       Age
Survived Sex
0        female  25.046875
         male    31.618056
1        female  28.847716
         male    27.276022